"""
10.	Дано ціле число в діапазоні 100-999. Вивести рядок-опис даного числа, наприклад: 256 - "двісті п'ятдесят шість", 814 - "вісімсот чотирнадцять».
"""
nubNames = {
'0': {'1': "Сто ", '2': "Двісті ", '3': "Триста ", '4': "Чотириста ", '5': "П'ятсот ", '6': "Шістсот ", '7': "Сімсот ", '8': "Вісімсот ", '9': "Девятсот "},
'1': {'1': "десять ", '2': "двадцять ", '3': "тридцять ", '4': "сорок ", '5': "п'ятдесять ", '6': "шістдесять ", '7': "сімдесять ", '8': "вісімдесят ", '9': "девяносто "},
'2': {'1': "один", '2': "два", '3': "три", '4': "чотири", '5': "п'ять", '6': "шість", '7': "сім", '8': "вісім", '9': "девять"},
'3': {'10': "десять", '11': "одинадцять", '12': "дванадцять", '13': "тринадцять", '14': "чотирнадцять", '15': "п'ятьнадцять", '16': "шістьнадцять", '17': "сімнадцять", '18': "вісімнадцять", '19': "девятьнадцять"}
}
userNumber = int(input(""))
resultDesc = ''
curDepth = 100
for i in range(3):
    if i == 1 and userNumber//curDepth == 1:
        resultDesc += nubNames[str(i+2)][str(int(userNumber // 1))]
        break
    elif int(userNumber // curDepth) == 0:
        continue
    else:
        resultDesc += nubNames[str(i)][str(int(userNumber // curDepth))]
        userNumber = userNumber % curDepth
        curDepth = curDepth / 10

print(resultDesc)

input()