"""
5.	Описати функцію DegToRad (D) дійсного типу, яка знаходить величину кута в радіанах,
якщо дана його величина D в градусах (D - дійсне число, 0 ≤ D <360).
Скористатися таким співвідношенням: 180 ° = π радіанів. Як значення π вважати рівним 3.14.
За допомогою функції DegToRad перевести з градусів в радіани п'ять даних кутів.
"""

def DegToRad(D):
    return str(round((D / 180) * 3.14, 2)) + " radian"

for i in range(5):
    D = int(input("Введіть значення в градусах: "))
    print(DegToRad(D))
input()